//1.指针函数：存放指针的函数，int*arr[5]
//           本质是数组，每个元素都是int*指针
//  数组指针：指向数组的指针，int(*p)[5]
//           本质是指针，指针整体指向长度为5的int数组
//  指针函数：返回值为指针的函数，int*func()
//           本质是函数，调用后返回一个地址
//  函数指针：指向指针的函数，int(*p)(int)
//           本质是指针，存储函数入口地址，可以用来调用函数
//
//2.(1)while先判断，后执行
//格式：while(条件)
//     {
//        循环体;
//     }
//逻辑：先看条件，条件不成立，一次都不运行。
//  (2)do while先执行，后判断
//格式：do
//     {
//         循环体;
//     }while(条件);
//逻辑：先运行一次代码，再判断条件，至少执行一次。
//
//3.for(初始化;判断条件;更新变量）
//  {
//    循环体;
//  }
//先执行一次初始化，然后判断条件，接着进入循环体，最后更新变量。如果条件为假，跳出循环体。
//
//4.在switch语句中，如果不加break，会导致循环体穿透执行，进入死循环。
// 
//5.char[]="hello";
//  s[0]='H';
//
//6.#define和const常量的区别
//(1)处理阶段不同
//   #define：预处理阶段直接文本替换，无类型检查
//   const：编译阶段处理，是带数据类型的变量
//(2)数据类型
//   #define：无类型，纯文本替换，容易出错
//   const：有明确类型，运算遵循语法规则
//(3)内存占用
//   #define：不分配内存，仅替换文本
//   const：占用内存，存放在只读数据区
//(4)作用域
//   #define：默认全局有效，#undef才能取消
//   const：遵循变量作用域（局部/全局）
//(5)调式优势
//   #define：调试器看不到宏名称，只有替换后文本
//   const：调试可直接看到常量名，方便排错
//(6)指针、函数参数
//   const可修饰指针、函数形参；#define做不到类型限定
// 
//7.
#include<stdio.h>
void sort(int arr[], int n)
{
	int i, j, temp;
	for (i = 0;i < n - 1;i++)
	{
		for (j = 0;j < n - 1 - i;j++)
		{
			if (arr[j] > arr[j + 1])
			{
				temp = arr[j];
				arr[j] = arr[j + 1];
				arr[j + 1] = temp;
			}
		}
	}
}
int main()
{
	int i = 0;
	int a[] = { 5,2,4,1,3 };
	int len = sizeof(a) / sizeof(a[0]);
	sort(a, len);
	for (i = 0;i < len;i++)
		printf("%d", a[i]);
	return 0;
}
//
//8.改错 int fun(int a)
//       {
//          int b = 10;
//          return b;
//       }
// 
//9.声明外部全局变量/外部函数，告诉编译器该变量、函数定义在其他.c源文件里，本文件仅做声明，不重新分配内存、不重复定义。
//  (1)int a;
//     定义变量：分配内存空间
//     编译器给a开辟一块存储单元，可赋值；
//     写在全局区：全局变量，默认初始0；
//     写在函数内：局部变量，随机垃圾值；
//  (2)extern int a;
//     声明变量：只告诉编译器变量存在，不分配内存；
//     只是告诉程序：有个全局整型a在别的文件或是代码块里；
//     不能给它赋初始值；
//     必须保证整个代码里只有一处 int a；定义
//
//10.阻止编译器优化读写，每次都直接从内存读取/写入变量，不适用CPU寄存器缓存副本
//
//11.#include"xxx.h"是自己项目的头文件，#include<xxx.h>是系统自带库的头文件